app/views/trains/_form.html.erb

    <%= form.label :current_station, "Текущая станция" %>
     <%= form.collection_select :current_station_id, RailwayStation.all, :id, :title %>
---
SELECT "railway_stations".* FROM "railway_stations"

    <%= form.label :route, 'Маршрут' %>
     <%= form.collection_select :route_id, Route.all, :id, :name %>
---
SELECT "routes".* FROM "routes"