app/views/trains/show.html.erb

SELECT "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Маршрут: </strong>
  <% if @train.route.present? %>

SELECT "wagons".* FROM "wagons" WHERE "wagons"."train_id" = ?  [["train_id", 1]]
---
  <strong>Вагоны прикрепленные к поезду: </strong>
  <% if @train.wagons.present? %>
    <% @train.wagons.each do |wagon| %>

SELECT COUNT(*) FROM "wagons" WHERE "wagons"."train_id" = ?  [["train_id", 1]]
---
    <% end %>
    Всего: <%= @train.wagons.count %> wagon

SELECT "wagons".* FROM "wagons" WHERE "wagons"."train_id" = ? AND "wagons"."type_wagon" = ?  [["train_id", 1], ["type_wagon", "Купе"]]
SELECT COUNT(*) FROM "wagons" WHERE "wagons"."train_id" = ? AND "wagons"."type_wagon" = ?  [["train_id", 1], ["type_wagon", "Купе"]]
---
  <strong>Количество плацкартных вагонов</strong>
  <%= @train.wagons.where(type_wagon: 'Плацкард').count %>

SELECT SUM("wagons"."cnt_bottom_place") FROM "wagons" WHERE "wagons"."train_id" = ? AND "wagons"."type_wagon" = ?  [["train_id", 1], ["type_wagon", "Плацкард"]]
---
  <p>
    Нижние: <%= @train.wagons.where(type_wagon: 'Плацкард').sum(:cnt_bottom_place) %>

SELECT SUM("wagons"."cnt_top_place") FROM "wagons" WHERE "wagons"."train_id" = ? AND "wagons"."type_wagon" = ?  [["train_id", 1], ["type_wagon", "Плацкард"]]
---
  <p>
    Верхние: <%= @train.wagons.where(type_wagon: 'Плацкард').sum(:cnt_top_place) %>

SELECT COUNT(*) FROM "wagons" WHERE "wagons"."train_id" = ? AND "wagons"."type_wagon" = ?  [["train_id", 1], ["type_wagon", "Купе"]]
---
  <strong>Количество купейных вагонов</strong>
  <%= @train.wagons.where(type_wagon: 'Купе').count %>

SELECT SUM("wagons"."cnt_bottom_place") FROM "wagons" WHERE "wagons"."train_id" = ? AND "wagons"."type_wagon" = ?  [["train_id", 7], ["type_wagon", "Купе"]]
---
  <p>
    Нижние: <%= @train.wagons.where(type_wagon: 'Купе').sum(:cnt_bottom_place) %>

SELECT SUM("wagons"."cnt_top_place") FROM "wagons" WHERE "wagons"."train_id" = ? AND "wagons"."type_wagon" = ?  [["train_id", 7], ["type_wagon", "Купе"]]
---
  <p>
    Верхние: <%= @train.wagons.where(type_wagon: 'Купе').sum(:cnt_top_place) %>