app/views/tickets/_form.html.erb

SELECT "trains".* FROM "trains"
---
    <%= form.label :train, "Поезд" %>
    <%= form.collection_select :train_id, Train.all, :id, :number %>

SELECT "users".* FROM "users"
---
    <%= form.label :user, "Пользователь" %>
    <%= form.collection_select :user_id, User.all, :id, :name %>