app/views/wagons/_form.html.erb

SELECT "trains".* FROM "trains"
---
    <%= form.label 'Поезд' %>
    <%= form.collection_select :train_id, Train.all, :id, :number %>