app/controllers/routes_controller.rb

  def create
    @route = Route.new(route_params)

    if @route.save
---
INSERT INTO "routes" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", " Второй маршрут"], ["created_at", "2021-04-23 19:55:31.220585"], ["updated_at", "2021-04-23 19:55:31.220585"]]

  def update
    if @route.update(route_params)
---
UPDATE "routes" SET "name" = ?, "updated_at" = ? WHERE "routes"."id" = ?  [["name", " Второй маршрутc"], ["updated_at", "2021-04-23 20:10:57.302205"], ["id", 2]]

  def destroy
    @route.destroy
---
DELETE FROM "routes" WHERE "routes"."id" = ?  [["id", 2]]

  def set_route
    @route = Route.find(params[:id])
---
SELECT "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]