app/controllers/trains_controller.rb

INSERT INTO "trains" ("number", "created_at", "updated_at", "current_station_id", "route_id") VALUES (?, ?, ?, ?, ?)  [["number", "159"], ["created_at", "2021-04-27 16:26:17.875679"], ["updated_at", "2021-04-27 16:26:17.875679"], ["current_station_id", 6], ["route_id", 4]]
---
  def create
    @train = Train.new(train_params)

    if @train.save(validate: false)

UPDATE "trains" SET "updated_at" = ?, "current_station_id" = ?, "route_id" = ? WHERE "trains"."id" = ?  [["updated_at", "2021-04-27 16:25:56.410669"], ["current_station_id", 1], ["route_id", 1], ["id", 2]]
---
  def update
    if @train.update(train_params)

DELETE FROM "trains" WHERE "trains"."id" = ?  [["id", 4]]
---
  def destroy
    @train.destroy

SELECT "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def set_train
    @train = Train.find(params[:id])