app/controllers/wagons_controller.rb

SELECT "wagons".* FROM "wagons"
---
  def index
    @wagons = Wagon.all

INSERT INTO "wagons" ("number", "type_wagon", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["number", "174"], ["type_wagon", "Плацкард"], ["created_at", "2021-04-27 21:55:36.343273"], ["updated_at", "2021-04-27 21:55:36.343273"]]
---
  def create
    @wagon = Wagon.new(wagon_params)

    if @wagon.save

UPDATE "wagons" SET "type_wagon" = ?, "cnt_top_place" = ?, "cnt_bottom_place" = ?, "updated_at" = ? WHERE "wagons"."id" = ?  [["type_wagon", "Купе"], ["cnt_top_place", 5], ["cnt_bottom_place", 5], ["updated_at", "2021-04-27 23:34:21.903628"], ["id", 3]]
---
  def update
    if @wagon.update(wagon_params)

DELETE FROM "wagons" WHERE "wagons"."id" = ?  [["id", 1]]
---
  def destroy
    @wagon.destroy

SELECT "wagons".* FROM "wagons" WHERE "wagons"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def set_wagon
    @wagon = Wagon.find(params[:id])