app/views/routes/show.html.erb

  <strong>Список поездов на маршруте:</strong>
  <% if @route.trains.present? %>
---
SELECT "trains".* FROM "trains" WHERE "trains"."route_id" = ?  [["route_id", 1]]